# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11-Corrected: Fixed Stride/Size Mismatch
# Integrated: P2 Layer + Faster_C3k2_SimAM + SPPELAN + C2PSA + BiFPN

nc: 4 # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, Faster_C3k2_SimAM, [128, False, 0.25]] # 2-P2/4 (High Res Feature)

  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, Faster_C3k2_SimAM, [256, False, 0.25]] # 4-P3/8

  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, Faster_C3k2_SimAM, [512, False, 0.25]] # 6-P4/16

  - [-1, 1, Conv, [512, 3, 2]] # 7-P5/32 (Previously Missing)
  - [-1, 2, Faster_C3k2_SimAM, [512, True]] # 8-P5/32

  - [-1, 1, SPPELAN, [512, 256]] # 9-P5/32 (Global Context)
  - [-1, 1, C2PSA, [512]] # 10-P5/32 (Attention)

# Head (BiFPN + P2 Support)
head:
  # === Top-Down Pathway (FPN) ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11 P5->P4
  - [[-1, 6], 1, Concat, [1]] # 12 cat backbone P4 (Layer 6)
  - [-1, 2, Faster_C3k2_SimAM, [512, False]] # 13 P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14 P4->P3
  - [[-1, 4], 1, Concat, [1]] # 15 cat backbone P3 (Layer 4)
  - [-1, 2, Faster_C3k2_SimAM, [256, False]] # 16 P3

  # === P2 Layer Fusion (Tiny Object) ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17 P3->P2
  - [[-1, 2], 1, Concat, [1]] # 18 cat backbone P2 (Layer 2)
  - [-1, 2, Faster_C3k2_SimAM, [128, False]] # 19 P2 Head

  # === Bottom-Up Pathway (BiFPN + PANet) ===
  - [-1, 1, Conv, [128, 3, 2]] # 20 P2->P3
  - [[-1, 16], 1, Concat, [1]] # 21 cat P3_td (Layer 16)
  - [-1, 2, Faster_C3k2_SimAM, [256, False]] # 22 P3_out

  - [-1, 1, Conv, [256, 3, 2]] # 23 P3->P4
  # BiFPN Skip: P4_td(13) + P4_backbone(6) + P4_up(-1)
  - [[-1, 13, 6], 1, Concat, [1]] # 24
  - [-1, 2, Faster_C3k2_SimAM, [512, False]] # 25 P4_out

  - [-1, 1, Conv, [512, 3, 2]] # 26 P4->P5
  - [[-1, 10], 1, Concat, [1]] # 27 cat P5_backbone (Layer 10 - C2PSA)
  - [-1, 2, Faster_C3k2_SimAM, [512, True]] # 28 P5_out

  # Detect Head (4 Heads: P2, P3, P4, P5)
  - [[19, 22, 25, 28], 1, Detect, [nc]]
