# ============================================================
# YOLO11s-Refined-EMA (Correct Routing)
# ------------------------------------------------------------
# 修正了 EMA 的连接方式，确保特征流能够正确通过注意力模块传输到
# 下一层及检测头。
# ============================================================

nc: 4

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ---------------- Backbone (保持不变) ----------------
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]

  # Global context
  - [-1, 1, SPPELAN, [1024, 256]]       # 9
  - [-1, 2, C2PSA, [1024]]              # 10

# ---------------- Head (路由修正) ----------------
head:
  # -------- P5 -> P4 --------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, CSPPC, [512]]               # 13 (P4 Feature)

  # -------- P4 -> P3 --------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, CSPPC, [256]]               # 16 (P3 Feature)

  # [EMA 插入点 1]
  # 放在特征融合(CSPPC)之后，对 P3 特征进行提纯
  - [-1, 1, EMA, []]                    # 17 (P3 Attention Output)

  # -------- P3 -> P2  --------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, CSPPC, [128]]               # 19 (P2 Feature)

  # [EMA 插入点 2]
  # 对微小目标最重要的 P2 特征进行提纯
  - [-1, 1, EMA, []]                    # 20 (P2 Attention Output)

  # -------- PAN Down (Bottom-Up) --------
  # 这里的路由必须修改，不能连接 CSPPC，而要连接 EMA 的输出

  - [-1, 1, Conv, [256, 3, 2]]          # 21 (Downsample P2->P3)

  # [路由修正 1] Concat 连接 Layer 17 (P3 EMA)，而不是 Layer 16
  - [[-1, 17], 1, Concat, [1]]          # 22
  - [-1, 3, CSPPC, [256]]               # 23 (P3 Output)

  - [-1, 1, Conv, [512, 3, 2]]          # 24 (Downsample P3->P4)

  # [路由检查] 这里连接 Layer 13 (P4) 是对的，因为 P4 没有加 EMA
  # 如果你在 Layer 13 后也加了 EMA，这里也要改成对应的 EMA 层索引
  - [[-1, 13], 1, Concat, [1]]          # 25
  - [-1, 3, CSPPC, [512]]               # 26 (P4 Output)

  - [-1, 1, Conv, [1024, 3, 2]]         # 27 (Downsample P4->P5)
  - [[-1, 10], 1, Concat, [1]]          # 28
  - [-1, 3, CSPPC, [1024]]              # 29 (P5 Output)

  # -------- Detect Head --------
  # [路由修正 2]
  # P2 输入必须是 Layer 20 (P2 EMA)，而不是 19
  # P3 输入是 Layer 23 (Bottom-up output)
  # P4 输入是 Layer 26
  # P5 输入是 Layer 29
  - [[20, 23, 26, 29], 1, Detect, [nc]] # [P2_EMA, P3_PAN, P4_PAN, P5_PAN]
