nc: 4

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ---------------- Backbone ----------------
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]

  # Global context
  - [-1, 1, SPPELAN, [1024, 256]]        # 9
  - [-1, 2, C2PSA, [1024]]               # 10 (P5 backbone out)

# ---------------- Head ----------------
head:
  # -------- P5 -> P4 --------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, CSPPC, [512]]                # 13 (P4)

  # -------- P4 -> P3 --------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, CSPPC, [256]]                # 16 (P3)
  - [-1, 1, ECA, []]                     # P3 attention

  # -------- P3 small-object enhancement --------
  - [-1, 1, DWConv, [256, 3, 1]]          # local detail
  - [-1, 1, Conv, [256, 3, 1, 1, 2]]      # dilated conv (d=2)
  - [-1, 1, ECA, []]                      # channel refine
  # output index: 19 (Enhanced P3)

  # -------- PAN Down --------
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 3, CSPPC, [512]]                # 22 (P4 PAN)

  - [-1, 1, Conv, [1024, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 3, CSPPC, [1024]]               # 25 (P5 PAN)

  # -------- P4 -> P3 Context Injection --------
  - [22, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 19], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False, 0.25]]    # 28 (Final P3)

  # -------- Detect --------
  - [[28, 22, 25], 1, Detect, [nc]]      # P3, P4, P5
