# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11-DySample-ScConv-P2-FINAL

nc: 4
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]     # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # 1-P2/4 (Layer 1: P2特征来源)
  - [-1, 2, C3k2_Sc, [256, False, 0.25]] # 2

  - [-1, 1, Conv, [256, 3, 2]]    # 3-P3/8
  - [-1, 2, C3k2_Sc, [512, False, 0.25]] # 4 (Layer 4: P3特征来源)

  - [-1, 1, Conv, [512, 3, 2]]    # 5-P4/16
  - [-1, 2, C3k2_Sc, [512, True]] # 6 (Layer 6: P4特征来源)

  - [-1, 1, Conv, [512, 3, 2]]    # 7-P5/32 (下采样到 P5)
  - [-1, 2, C3k2_Sc, [512, True]] # 8
  - [-1, 1, SPPF, [512, 5]]       # 9-P5/32

head:
  # === Top-Down (FPN) with DySample ===
  - [-1, 1, DySample, [2]]        # 10 P5->P4
  - [[-1, 6], 1, Concat, [1]]     # 11 Cat backbone P4
  - [-1, 2, C3k2_Sc, [512, False]] # 12 P4

  - [-1, 1, DySample, [2]]        # 13 P4->P3
  - [[-1, 4], 1, Concat, [1]]     # 14 Cat backbone P3
  - [-1, 2, C3k2_Sc, [256, False]] # 15 P3

  # --- P3->P2 动态上采样路径 ---
  - [-1, 1, DySample, [2]]        # 16 P3->P2
  - [[-1, 1], 1, Concat, [1]]     # 17 Cat with Backbone P2
  - [-1, 2, C3k2_Sc, [128, False]] # 18 P2 Head Feature

  # === Bottom-Up (PANet) ===
  - [-1, 1, Conv, [128, 3, 2]]    # 19 P2->P3
  - [[-1, 15], 1, Concat, [1]]    # 20 Cat P3_TD
  - [-1, 2, C3k2_Sc, [256, False]] # 21 P3_Out

  - [-1, 1, Conv, [256, 3, 2]]    # 22 P3->P4
  - [[-1, 12], 1, Concat, [1]]    # 23 Cat P4_TD
  - [-1, 2, C3k2_Sc, [512, False]] # 24 P4_Out

  - [-1, 1, Conv, [512, 3, 2]]    # 25 P4->P5
  - [[-1, 9], 1, Concat, [1]]     # 26 Cat P5_Backbone
  - [-1, 2, C3k2_Sc, [512, True]] # 27 P5_Out

  # === Detect Head (4 Heads: P2, P3, P4, P5) ===
  - [[18, 21, 24, 27], 1, Detect, [nc]]
