# YOLO11-ResNet-Hybrid
# Hybrid architecture combining C3k2 and ResNet blocks

nc: 4

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]

backbone:
  # [from, repeats, module, args]

  # Stage 0: Stem
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4

  # Stage 1: C3k2
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2 (P2 feature: 256ch)

  # Stage 2: P3
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 1, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, ResNetBlock, [512, 512, 1, 1]]  # 5 (P3 feature: 512ch)

  # Stage 3: P4
  - [-1, 1, Conv, [512, 3, 2]]         # 6-P4/16
  - [-1, 2, ResNetBlock, [512, 512, 1, 1]]  # 7
  - [-1, 1, C3k2, [512, True, 0.5]]    # 8 (P4 feature: 512ch)

  # Stage 4: P5
  - [-1, 1, Conv, [512, 3, 2]]         # 9-P5/32
  - [-1, 3, ResNetBlock, [512, 512, 1, 1]]  # 10

  # Global context
  - [-1, 1, SPPELAN, [512, 256]]       # 11
  - [-1, 1, C2PSA, [512]]              # 12

  # P5 feature with attention
  - [-1, 1, ECA, []]                   # 13 (P5 feature: 512ch)


head:
  # -------- P5 -> P4 --------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 8], 1, Concat, [1]]                   # 15: 512 + 512 = 1024
  - [-1, 3, CSPPC, [512]]                       # 16 P4_out

  # -------- P4 -> P3 --------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17
  - [[-1, 5], 1, Concat, [1]]                   # 18: 512 + 512 = 1024
  - [-1, 3, CSPPC, [256]]                       # 19 P3_out

  # -------- P3 -> P2 --------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 20
  - [[-1, 2], 1, Concat, [1]]                   # 21: 256 + 256 = 512
  - [-1, 3, CSPPC, [128]]                       # 22 P2_out

  # -------- PAN down --------
  - [-1, 1, Conv, [256, 3, 2]]                  # 23
  - [[-1, 19], 1, Concat, [1]]                  # 24: 256 + 256 = 512
  - [-1, 3, CSPPC, [256]]                       # 25 P3_pan

  - [-1, 1, Conv, [512, 3, 2]]                  # 26
  - [[-1, 16], 1, Concat, [1]]                  # 27: 512 + 512 = 1024
  - [-1, 3, CSPPC, [512]]                       # 28 P4_pan

  - [-1, 1, Conv, [1024, 3, 2]]                 # 29
  - [[-1, 13], 1, Concat, [1]]                  # 30: 512 + 512 = 1024 (ECA output)
  - [-1, 3, CSPPC, [1024]]                      # 31 P5_pan

  # Detect: P2_out(22), P3_pan(25), P4_pan(28), P5_pan(31)
  - [[22, 25, 28, 31], 1, Detect, [nc]]