# YOLO11-SPD-EMA-P2

nc: 4
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]     # 0-P1/2
  - [-1, 1, SPDConv, [128]]       # 1-P2/4 (Layer 1: P2特征来源)
  - [-1, 2, C3k2, [256, False, 0.25]] # 2

  - [-1, 1, SPDConv, [256]]       # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4 (Layer 4: P3特征来源)

  - [-1, 1, SPDConv, [512]]       # 5-P4/16
  - [-1, 2, C3k2, [512, True]]    # 6 (Layer 6: P4特征来源)

  # === [关键修复] 之前漏掉了这一层 P4->P5 的下采样 ===
  - [-1, 1, SPDConv, [512]]       # 7-P5/32 (新增)
  - [-1, 2, C3k2, [512, True]]    # 8
  - [-1, 1, SPPF, [512, 5]]       # 9-P5/32 (Global Context)

head:
  # === Top-Down (FPN) ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10 P5->P4
  - [[-1, 6], 1, Concat, [1]]     # 11 Cat backbone P4 (Layer 6)
  - [-1, 2, C3k2, [512, False]]   # 12 P4
  - [-1, 1, EMA, []]              # 13 (P4 Attention)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14 P4->P3
  - [[-1, 4], 1, Concat, [1]]     # 15 Cat backbone P3 (Layer 4)
  - [-1, 2, C3k2, [256, False]]   # 16 P3
  - [-1, 1, EMA, []]              # 17 (P3 Attention)

  # === P2 Layer Fusion (Tiny Object) ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18 P3->P2
  - [[-1, 1], 1, Concat, [1]]     # 19 Cat backbone P2 (Layer 1)
  - [-1, 2, C3k2, [128, False]]   # 20 P2 Head
  - [-1, 1, EMA, []]              # 21 (P2 Attention)

  # === Bottom-Up (PANet) ===
  - [-1, 1, SPDConv, [128]]       # 22 P2->P3
  - [[-1, 17], 1, Concat, [1]]    # 23 Cat P3_TD (Layer 17)
  - [-1, 2, C3k2, [256, False]]   # 24 P3_Out

  - [-1, 1, SPDConv, [256]]       # 25 P3->P4
  - [[-1, 13], 1, Concat, [1]]    # 26 Cat P4_TD (Layer 13)
  - [-1, 2, C3k2, [512, False]]   # 27 P4_Out

  - [-1, 1, SPDConv, [512]]       # 28 P4->P5
  - [[-1, 9], 1, Concat, [1]]     # 29 Cat P5_Backbone (Layer 9)
  - [-1, 2, C3k2, [512, True]]    # 30 P5_Out

  # === Detect Head (4 Heads: P2, P3, P4, P5) ===
  - [[21, 24, 27, 30], 1, Detect, [nc]] # 包含 Layer 21 (P2)
